app/controllers/entries_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1
---
  def index
    #@entries = Entry.all
    unless params[:user_id].nil?
      @user = User.find(params[:user_id])
    end
    if @user.nil?
      @entries = Entry.all
      #if @entries.nil?
      #  @entries = Array.new
      #  @entries[0] = Entry.create(:user_id => )
      #end
    else
      @entries = Entry.where (:user_id => @user.id)

INSERT INTO "entries" ("created_at", "date", "updated_at", "user_id") VALUES ('2011-05-25 20:50:55.873544', '2011-05-25', '2011-05-25 20:50:55.873544', 1)
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def create
    @user = current_user
    @entry = User.find(params[:user_id]).entries.create(:user_id =>
                                                        params[:user_id])