app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"

  def show
    @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1

  def create
    @template = Template.new(params[:template])

    respond_to do |format|
      if @template.save
---
INSERT INTO "templates" ("name", "description", "user_id", "created_at", "updated_at") VALUES ('CrazyWorkout', 'here is my crazy version of fran', 1, '2011-05-26 03:39:46.389491', '2011-05-26 03:39:46.389491')