app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "encrypted_password", "salt", "created_at", "updated_at") VALUES ('moose', 'alaska@us.com', NULL, '1115d82e163c5128315aa61f6566aa8ee5d4ef24fe35d99be2020140de2f3b95', '28e4a762f28bf4f51ae14ae29b53ca960e01a844ba4be57d751e76c4362d4650', '2011-05-26 02:36:16.881645', '2011-05-26 02:36:16.881645')