app/controllers/workouts_controller.rb

  def index
    @workouts = Workout.all
---
SELECT "workouts".* FROM "workouts"

  def show
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 1 LIMIT 1

  def new
    @workout = Workout.new
    # fetches all the crossfit templates ordered by name
    @templates = Template.where(:user_id =>
      User.find_by_name("crossfit").id).order(:name)
---
SELECT "templates".* FROM "templates" WHERE "templates"."user_id" = 1 ORDER BY name

  def edit
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 2 LIMIT 1

  def create
    @workout = Workout.new(params[:workout])
    if @workout.template_id != nil
      @template = Template.find(@workout.template_id)
      if @template.name != "Custom"
        @workout.attributes = { :name => @template.name,
          :description => @template.description }
        @workout.save
        @exercises = @template.exercises
        @exercises.each do |exercise|
          @temp = @workout.exercises.create(:name => exercise.name,
                                    :reps => exercise.reps,
                                    :weight => exercise.weight )
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
INSERT INTO "workouts" ("updated_at", "name", "description", "template_id", "entry_id", "created_at") VALUES ('2011-05-23 09:24:41.402894', 'something', NULL, 1, NULL, '2011-05-23 09:24:41.402894')
SELECT "exercises".* FROM "exercises" WHERE ("exercises".exerciseable_id = 1 AND "exercises".exerciseable_type = 'Template')
INSERT INTO "exercises" ("created_at", "exerciseable_type", "reps", "name", "updated_at", "weight", "exerciseable_id") VALUES ('2011-05-23 09:52:51.172586', 'Workout', 100, 'Pull-ups', '2011-05-23 09:52:51.172586', NULL, 6)

  def destroy
    @workout = Workout.find(params[:id])
    @workout.destroy
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 1 LIMIT 1
DELETE FROM "workouts" WHERE "workouts"."id" = 1